Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetInsertOnlyAnalysisPart
Get insert only analysis part enabled mode.
Returns: True if insert only analysis part is enabled.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.SetInsertOnlyAnalysisPart(System.Boolean)
Set insert only analysis part enabled mode.
onlyAnalysisPart: True if insert only analysis part is enabled.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetUpdateAnalysisOnPhysicalChange
Get update analysis on physical change mode.
Returns: True if insert only analysis part is enabled.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.SetUpdateAnalysisOnPhysicalChange(System.Boolean)
Set update analysis on physical change mode.
If enabled, the analysis model is updated automatically if it is active when physical model is changed.
updateAnalysis: True if analysis model is updated on physical change.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetObjectTimes(Tekla.Structures.Identifier)
Get object change management data times.
Returns the times at which both physical and analytical data exist for given part.
partId: The physical part or analysis part identifier.
Returns: The object change management data times.